trade_exp/src/Documents/ПриходныйКассовыйОрдер/ПриходныйКассовыйОрдер.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПриходныйКассовыйОрдер</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ХозяйственнаяОперация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Кассир</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПодотчетноеЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СтатьяДвиженияДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГлавныйБухгалтер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДоверенностьВыданная</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаККМ</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КассаОтправитель</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>КурсКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>10</precision>
          <scale>4</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>БанковскийСчет</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВалютаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Приложение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Основание</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Валюта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>СуммаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВТомЧислеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ДокументОснование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПринятоОт</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>250</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Касса</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РаспоряжениеНаПеремещениеДенежныхСредств</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>НаправлениеДеятельности</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Договор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ГруппаФинансовогоУчета</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДеньгиВнесеныCотрудником</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СотрудникВнесшийДеньги</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes extendedConfigurationObject="8883b2d0-a5b9-4340-ba78-26c65139acc4">
    <name>НалогообложениеНДС</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="0a1c1d55-366e-43cb-8439-93ee576690ae">
    <name>Партнер</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="58f144c7-5fda-443f-9eba-f223e9943695">
    <name>КратностьКурсаКонвертации</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="cff8f06f-bc4b-4e6b-9b4d-5950964e2129">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>РасшифровкаПлатежа</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ДоговорКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаРасходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ДоговорЗаймаСотруднику</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СтатьяДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ИдентификаторСтроки</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>36</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СуммаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Партнер</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Сумма</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ВалютаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаДоходов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтавкаНДС</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СуммаВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>АналитикаАктивовПассивов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОснованиеПлатежа</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтатьяДвиженияДенежныхСредств</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ТипСуммыКредитаДепозита</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Организация</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Подразделение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="10fa07b1-5a87-4461-aa12-363a0e2dcbe0">
      <name>ОбъектРасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="aba486ff-7913-419f-a30a-54e7051d8781">
      <name>НастройкаСчетовУчета</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="cb507992-a434-4b87-b5fc-2dedaaad5197">
      <name>ДоговорАренды</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="791145c7-c177-49dd-9f53-9f6842c3a1bd">
      <name>ТипПлатежаПоАренде</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>10</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="ea2e5a37-549f-4567-b4af-235dd476e2cc">
      <name>РасчетныйДокументПоАренде</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="b8195c88-ac4b-4fc2-a1c7-dceb6683e8f4">
      <name>КурсЗнаменательВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="3dea0088-c6d9-458f-b093-d64eb55cdffd">
      <name>КурсЧислительВзаиморасчетов</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
            <scale>4</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="c61a3692-b940-4015-bb16-55fe766bad68">
    <name>ДополнительныеРеквизиты</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="5572011c-09eb-401f-83fd-579e97ce4bda">
      <name>Свойство</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="6ae13040-3ec8-4088-b96f-0f527dab3086">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="1db7c744-182b-48e1-93fd-95d6c880eaf2">
      <name>ТекстоваяСтрока</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/Enums/ЮрФизЛицо/ЮрФизЛицо.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ЮрФизЛицо</name>
  <objectBelonging>Adopted</objectBelonging>
  <enumValues>
    <name>ФизЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="9f77fc56-3329-4a10-b355-b5c40df8b5c5">
    <name>ИндивидуальныйПредприниматель</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
  <enumValues extendedConfigurationObject="1312f787-af91-4e9f-bb79-f968d50d327d">
    <name>ЮрЛицо</name>
    <objectBelonging>Adopted</objectBelonging>
  </enumValues>
</mdclass:Enum>

trade_exp/src/Documents/ПриходныйКассовыйОрдер/Forms/ФормаДокумента/Module.bsl
&НаКлиенте
Процедура Док_ПриОткрытииПосле(Отказ)
	Если Не ЗначениеЗаполнено(Объект.Номер) Тогда//Новый
		Если ЗначениеЗаполнено(Объект.ДокументОснование)  Тогда
			Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
				//Задача №40041 от Селезневой ставить сумму не по взаиморасчетом, а по реализации						
				Объект.СуммаДокумента= АльтерраОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ДокументОснование, "СуммаДокумента");
				СуммаДокументаПриИзменении(Неопределено);
				
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
	Если Не ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг") Тогда
			Если ПоказатьПредупреждениеОбИзмененииСуммы(Объект) Тогда
				АльтерраОбщегоНазначения.СообщитьПользователю(Объект.Ссылка, "Необходимо изменить сумму", "Объект.СуммаДокумента");
			КонецЕсли;
		КонецЕсли;
		ЗаполнитьЗначения();
	КонецЕсли;
КонецПроцедуры

&ИзменениеИКонтроль("ЗаполнитьКассира")
&НаСервере
Процедура Док_ЗаполнитьКассира()
    #Удаление
	КассирКассы = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.Касса, "Кассир");
	Если ЗначениеЗаполнено(КассирКассы) Тогда
		Объект.Кассир = КассирКассы;
	Иначе
	#КонецУдаления
		Объект.Кассир = ДенежныеСредстваСервер.КассирПоследнегоРКОИлиПКО(Объект.Дата, Объект.Организация, Объект.Касса);
	#Удаление
	КонецЕсли;
    #КонецУдаления
КонецПроцедуры

&НаКлиенте
Процедура Док_СуммаНаличныхПриИзмененииПосле(Элемент)
	Сдача=СуммаНаличных-Объект.СуммаДокумента;
КонецПроцедуры

&НаСервере
Функция ПоказатьПредупреждениеОбИзмененииСуммы(Знач Объект)
	
	Если Не Объект.ДокументОснование.ИспользуетсяДоговор Тогда
		Если ЗначениеЗаполнено(Объект.ДокументОснование.ЗаказКлиента) Тогда
			ДокРасчетов= Объект.ДокументОснование.ЗаказКлиента;
		Иначе
			ДокРасчетов= Объект.ДокументОснование;
		КонецЕсли;
		ДолгКлиента= ПолучитьДолг(ДокРасчетов);
		
		Если ДолгКлиента <> Объект.ДокументОснование.СуммаДокумента Тогда
			Возврат Истина
		КонецЕсли;
	КонецЕсли;
	
	Возврат Ложь;
КонецФункции
&НаСервереБезКонтекста
Функция ПолучитьДолг(ЗаказКлиента)
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РасчетыСКлиентамиОстатки.КОплатеОстаток КАК КОплатеОстаток
	|ИЗ
	|	РегистрНакопления.РасчетыСКлиентами.Остатки(, ОбъектРасчетов.Объект = &ЗаказКлиента) КАК РасчетыСКлиентамиОстатки";
	
	Запрос.УстановитьПараметр("ЗаказКлиента", ЗаказКлиента);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		Возврат ВыборкаДетальныеЗаписи.КОплатеОстаток;
	КонецЦикла;
	
	Возврат 0;
КонецФункции 

&НаСервере
Процедура Док_ПриСозданииНаСервереПосле(Отказ, СтандартнаяОбработка)
	Если ЗначениеЗаполнено(Объект.Организация) тогда
		НоваяСвязь = Новый СвязьПараметраВыбора("Отбор.Владелец", "Объект.Организация");
		НовыйМассив = Новый Массив();                    
		НовыйМассив.Добавить(НоваяСвязь);                             
		НовыеСвязи = Новый ФиксированныйМассив(НовыйМассив);
		Элементы.Касса.СвязиПараметровВыбора = НовыеСвязи;	
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура Док_ХозяйственнаяОперацияПриИзмененииПосле(Элемент)
	ЗаполнитьСтатьюДДС();
	ЗаполнитьЗначения();	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЗначения()
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ Тогда
		Если НЕ ЗначениеЗаполнено(Объект.ВТомЧислеНДС) И Объект.Касса.Владелец.Наименование="Альтерра ООО" Тогда
			Объект.ВТомЧислеНДС = "НДС";	
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(Объект.ПринятоОт) Тогда
			Объект.ПринятоОт = "Физическое лицо";	
		КонецЕсли;
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСтатьюДДС()
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ВозвратДенежныхСредствОтПодотчетника Тогда
		ЗаполнитьТЧРасшифровка(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000004")); //ВОЗВРАТ ПОДОТЧЕТА	
	КонецЕсли;
	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеОплатыОтКлиента Тогда   
		ПриИзмененииКонтрагента();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьТЧРасшифровка(Статья)
	Для каждого стрРасшировка из Объект.РасшифровкаПлатежа Цикл
		стрРасшировка.СтатьяДвиженияДенежныхСредств = Статья;
	КонецЦикла;
КонецПроцедуры


&НаКлиенте
Процедура Док_КассаПриИзмененииПосле(Элемент)
	ЗаполнитьЗначения();
КонецПроцедуры

&НаКлиенте
Процедура Док_КонтрагентПриИзмененииПосле(Элемент)
	ПриИзмененииКонтрагента();
КонецПроцедуры  

&НаСервере
Процедура ПриИзмененииКонтрагента()
	если Объект.Контрагент.ЮрФизЛицо=Перечисления.ЮрФизЛицо.ФизЛицо тогда
		ЗаполнитьТЧРасшифровка(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000007")); //ВЫРУЧКА ФИЗИЧЕСКИЕ ЛИЦА     
		ПринятоОт= ?(значениезаполнено(ПринятоОт),ПринятоОт,"Физическое лицо");                                                          
	иначе	
		ЗаполнитьТЧРасшифровка(Справочники.СтатьиДвиженияДенежныхСредств.НайтиПоКоду("0А-000002")); //ПОСТУПЛЕНИЯ ОТ ПОКУПАТЕЛЕЙ
	Конецесли;
КонецПроцедуры

&НаКлиенте
&ИзменениеИКонтроль("СуммаДокументаПриИзмененииКлиент")
Функция Док_СуммаДокументаПриИзмененииКлиент()
   #Удаление
	Объект.ВТомЧислеНДС = ""; 
   #КонецУдаления
	ФинансыКлиентСервер.ПересчитатьСуммыВСтрокеРасшифровкиПлатежа(Объект, Объект.СуммаДокумента, Ложь);

	Возврат Истина;

КонецФункции


#Область НапечататьПоследнийСлипЧек

&НаКлиенте
Процедура НапечататьПоследнийСлипЧек(Команда)   
	Если ЗначениеЗаполнено(ФискальнаяОперацияПодключенноеОборудование) И ЗначениеЗаполнено(ФискальнаяОперацияПодключенноеОборудование.ККТ) Тогда
		ДопМодульКлиент.НапечататьПоследнийСлипЧек(ЭтотОбъект.УникальныйИдентификатор, ФискальнаяОперацияПодключенноеОборудование.ККТ);
    КонецЕсли;
КонецПроцедуры        

&НаСервере
Функция СуммаБольшеСуммыДокумента()

	Попытка
		Если ЗначениеЗаполнено(Объект.ДокументОснование) Тогда
			Если Не Объект.ДокументОснование.Метаданные().Реквизиты.Найти("СуммаДокумента") = Неопределено Тогда
				Возврат Объект.СуммаДокумента > Объект.ДокументОснование.СуммаДокумента; 
			Иначе
				Возврат Ложь;		
			КонецЕсли;
		Иначе
			Возврат Ложь;
		КонецЕсли;
	Исключение
		Возврат Ложь;
	КонецПопытки   

КонецФункции

&НаКлиенте
Процедура Док_СуммаДокументаПриИзмененииПосле(Элемент)
	Если СуммаБольшеСуммыДокумента() Тогда
		ПоказатьПредупреждение(,"Внимание, НЕЛЬЗЯ вводить сумму больше, чем сумма документа основания!",);
	КонецЕсли;
КонецПроцедуры


&НаСервере
Процедура ПодменитьНДСПоПоступлениюИзКассыККМАльтерра()

	Если Объект.ХозяйственнаяОперация = Перечисления.ХозяйственныеОперации.ПоступлениеДенежныхСредствИзКассыККМ тогда
	//	И Объект.Касса.Владелец.Наименование="Альтерра ООО" Тогда
		Объект.ВТомЧислеНДС = "НДС"; 
	КонецЕсли;

КонецПроцедуры // ПодменитьНДСПоПоступлениюИзКассыККМАльтерра()


&НаКлиенте
Процедура Док_ПередЗаписьюПеред(Отказ, ПараметрыЗаписи) 
	
	Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
		Отказ = ПроверкаНаВидКонтрагента(); 
	КонецЕсли;   
	
	ПодменитьНДСПоПоступлениюИзКассыККМАльтерра(); 
	ВставитьВТомЧислеНДСНаСервере();
	
КонецПроцедуры

&НаСервере
Функция ПроверкаНаВидКонтрагента() 
	
	СуммаОграничениеЮрЛиц = 100000;
	
	Если Не Объект.Контрагент.ЮрФизЛицо = Перечисления.ЮрФизЛицо.ФизЛицо Тогда 
		
		Если Объект.СуммаДокумента >= СуммаОграничениеЮрЛиц Тогда 
			
			Сообщить("ПКО с суммой от " + СуммаОграничениеЮрЛиц + " можно создавать только для Физических лиц!");
			Возврат Истина;
			
		ИначеЕсли ЗначениеЗаполнено(Объект.ДокументОснование) Тогда 
			
			Если ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.РеализацияТоваровУслуг")
			Или ТипЗнч(Объект.ДокументОснование) = Тип("ДокументСсылка.ЗаказКлиента") Тогда
				
				Возврат ПроверкаСуммыВсехПКОПоОснованию(СуммаОграничениеЮрЛиц);	 
				
			КонецЕсли; 
			
		КонецЕсли;
		
	КонецЕсли; 
	
	Возврат Ложь; 
	
КонецФункции

&НаСервере
Функция ПроверкаСуммыВсехПКОПоОснованию(СуммаОграничениеЮрЛиц)  
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ЕСТЬNULL(СУММА(ПриходныйКассовыйОрдер.СуммаДокумента), 0) КАК Сумма
	|ИЗ
	|	Документ.ПриходныйКассовыйОрдер КАК ПриходныйКассовыйОрдер
	|ГДЕ
	|	ПриходныйКассовыйОрдер.ДокументОснование = &ДокументОснование
	|	И ПриходныйКассовыйОрдер.Проведен = ИСТИНА
	|	И ПриходныйКассовыйОрдер.ПометкаУдаления = ЛОЖЬ
	|	И ПриходныйКассовыйОрдер.Ссылка <> &Ссылка";
	
	Запрос.УстановитьПараметр("ДокументОснование", Объект.ДокументОснование);   
	
	Если ЗначениеЗаполнено(Объект.Ссылка) Тогда
		Запрос.УстановитьПараметр("Ссылка", Объект.ссылка);
	Иначе 
		Запрос.УстановитьПараметр("Ссылка", Документы.ПриходныйКассовыйОрдер.ПустаяСсылка());
	КонецЕсли;
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Выборка = РезультатЗапроса.Выбрать();
	
	Если Выборка.Следующий() Тогда 
		
		ОбщаяСумма = Выборка.Сумма + Объект.СуммаДокумента; 
		
		Если ОбщаяСумма >= СуммаОграничениеЮрЛиц Тогда
			ОстатокНаличными = СуммаОграничениеЮрЛиц - Выборка.Сумма - 1;
			ОстатокНаличными = ?(ОстатокНаличными < 0,0,ОстатокНаличными);
			Сообщить("Общая сумма всех ПКО по одному основанию может превышать " + СуммаОграничениеЮрЛиц + " только для физических лиц!" +"
			|Остаток, который можно принять по данному ПКО = " + ОстатокНаличными );
			Возврат Истина;
		КонецЕсли; 
		
	КонецЕсли;
	
	Возврат Ложь; 
	
КонецФункции

&НаСервере
&После("ВставитьВТомЧислеНДСНаСервере")
Процедура Док_ВставитьВТомЧислеНДСНаСервере()
    ПодменитьНДСПоПоступлениюИзКассыККМАльтерра(); 
КонецПроцедуры



#КонецОбласти
